driver-tests/jmsbc/JMSBCTests/JMSBCjavaeeSETestJbi/test/JMSBCjavaeeSETest_Invoke/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inf="http://xml.netbeans.org/schema/InFromJMSBC">
  <soapenv:Body>
    <inf:InputElement>
      <inf:id>12345</inf:id>
      <inf:msg>Helloooooo JavaEE SE!!</inf:msg>
    </inf:InputElement>
  </soapenv:Body>
</soapenv:Envelope>